Revit 2026 API

# DWFExportOptionsExportTexture Property

---

Whether to export texture.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ExportTexture { get; set; }
```
```vb
Public Property ExportTexture As Boolean
	Get
	Set
```
```cpp
public:
property bool ExportTexture {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ExportTexture : bool with get, set
```

#### Property Value

Boolean

The default value is true. This property only take effect to 3D DWF.

#### Reference

DWFExportOptions Class

Autodesk.Revit.DB Namespace